{
    "_name_or_path": "sandbox-ai/Tango-70b",
    "architectures": [
        "LlamaForCausalLM"
    ],
    "model_type": "llama",
    "attention_bias": false,
    "attention_dropout": 0.0,
    "hidden_act": "silu",
    "hidden_size": 8192,
    "initializer_range": 0.02,
    "intermediate_size": 28672,
    "max_position_embeddings": 131072,
    "mlp_bias": false,
    "num_attention_heads": 64,
    "num_hidden_layers": 80,
    "num_key_value_heads": 8,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_theta": 500000.0,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "vocab_size": 128256
}
